examples/openfoam/example_pimpleFoamYadeMPI/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;


boundaryField
{
    y1
    {
        type            zeroGradient;
    }


    y0
    {
        type            zeroGradient;
    }

    x0
    {
        type            zeroGradient;
    }


    x1
    {
        type            zeroGradient;
    }


    z0
    {
        type            zeroGradient;
    }



    z1
    {
        type            zeroGradient;
    }


}
// ************************************************************************* //
